# import datetime
# now=datetime.datetime.now()
# time1=now.time()
# hour = now.hour
# minute = now.minute
# s1={"버거1":{"전체":{"더블쿼터파운더치즈":6000,"쿼터파운더치즈":5000,"불고기":3000,"더블불고기":3500,
#             "빅맥":4500,"치즈":3000,"베이컨토마토디럭스":5000,"햄버거":2500,"맥스파이시상하이":5500,
#             "맥치킨":4500,"맥크리스피디럭스":6000},
#
#             "비프":{"더블쿼터파운더치즈":6000,"쿼터파운더치즈":5000,"불고기":3000,"더블불고기":3500,
#             "빅맥":4500,"치즈":3000,"베이컨토마토디럭스":5000,"햄버거":2500},
#
#             "치킨":{"맥스파이시상하이":5500,"맥치킨":4500,"맥크리스피디럭스":6000}
#             }
# }
# s2={"맥런치2":{"빅맥세트":5500,"더블불고기세트":4500,"베이컨토마토디럭스세트":6000}}
# s3={"맥모닝3":{"에그맥머핀":2800,"소시지에그맥머핀":3000,"베이컨에그맥머핀":3300,"치킨맥머핀":3000}}
# s4={"해피스낵4":{"드립커피M":1000,"제로콜라M":1000,"치즈버거":2000,"치즈스틱2조각":2000,"후렌치후리이S":1000}}
# s5={"사이드5":{"맥윙2조각":2000,"맥윙4조각":3500,"맥윙8조각":6000,"치즈스틱2조각":2000,"치즈스틱4조각":3800,
#                 "후렌치후라이S":1000,"후렌치후라이M":1500,"후렌치후라이L":2000,"맥너겟4조각":2000,"맥너겟6조각":2800}}
# s6={"디저트6":{"맥플러리":3000,"아이스크림콘":1000}}
# s7={"맥카페7":{"카페라떼":2000,"아이스카페라떼":2000,"아이스드립커피":1000,"드립커피":1000}}
# s8={"음료8":{"콜라M":1000,"콜라L":1500,"콜라제로M":1000,"콜라제로L":1500,
#            "사이다M":1000,"사이다L":1500,"오렌지주스":1000,"생수":1000}}
#
# s9={"해피밀9":{"해피밀(맥머핀)":{"에그맥머핀":4000,"소시지에그맥머핀":4200,"베이컨에그맥머핀":4500},#오전04:00~오전10:30
#                 "해피밀(버거)":{"치즈버거":4200,"햄버거":3800,"불고기버거":4200}#오전10:30~오전04:00
#             }
#     }
# a_list=[s1,s2,s3,s4,s5,s6,s7,s8,s9]
#
# # 전체 / 비프 / 치킨 3가지로 나뉜다. 세트선택시 위 금액에 +1500원
# #맥런치는 단품은 없고 세트만 주문 가능 , *맥런치는 오전10시30분~오후14:00까지 주문 가능
# #맥모닝은 단품 or 세트 주문 가능 *오전04:00~오전10:30까지 주문가능 *세트선택시 위 금액에 +1500원
# #해피스낵은 사이즈변경이나 조각 수 변경 불가 위 조건으로만 판매
# #해피밀은 어린이용 세트로 사이드메뉴는 파인애플만 제공, 음료는 오렌지주스 혹은 생수 중 선택 가능하다
# #오전04:00~오전10:30
# #오전10:30~오전04:00
#
# def time():#시간별 메뉴함수
#     # 버거는 항상
#     menu_list = []
#     menu_list.append("버거")
#     if 10 <= hour < (hour == 14 and minute == 0):
#         menu_list.append("맥런치")
#     if 4 <= hour < (hour == 10 and minute == 30):
#         menu_list.append("맥모닝")
#     if 4 <= hour < 10:
#         menu_list.append("해피밀(맥머핀)")
#     elif hour == 10 and minute <= 30:
#         menu_list.append("해피밀(버거)")
#     menu_list.extend(["해피스낵", "사이드", "디저트", "맥카페", "음료"])
#     return menu_list
#
# # def menu():
# #     for i in s_list:
# #         for j in i:
# #             print(j)
# def menu():
#     categorie = time()
# #     print("시간별 메뉴 카테고리")
#     for i in categorie:
#         print(i)
#
# def menu1(i):
#     b_list = []
#     if i == "버거":
#     b_list= s1
#         pass
#     if i == "맥런치":
#         pass
#     if i == "맥모닝":
#         pass
#     if i == "해피스낵":
#         pass
#     if i == "사이드":
#         pass
#     if i == "디저트":
#         pass
#     if i == "맥카페":
#         pass
#     if i == "음료":
#         pass
#     if i == "해피밀(맥머핀)":
#         pass
#     if i == "해피밀(버거)":
#         pass
#
# x = input("1.주문하기(번호입력):")
# while True:
#     if x == "1":
#         x2 = input("1.포장 2.매장 3.처음으로: ")
#         if x2 == "1" or x2 == "2":
#             menu()
#             x3 = input("1.버거 2.맥런치 3.맥모닝 4.해피스낵 5.사이드 6.디저트 7.맥카페 8.음료 9.해피밀: ")
#             if x3 == "1":
#                 x3_1=input("버거 소분류) 1.전체 2.비프 3.치킨")
#                 if x3_1== "1":
#                     menu1("버거")
#                     pass
#                 elif x3_1=="2":
#                     menu1("버거")
#                     pass
#                 elif x3_1=="3":
#                     menu1("버거")
#                     pass
#             elif x3 == "2":
#                 menu1("맥런치")
#
#             elif x3 == "3":
#                 menu1("맥모닝")
#             elif x3 == "4":
#                 menu1("해피스낵")
#
#             elif x3 == "5":
#                 menu1("사이드")
#
#             elif x3 == "6":
#                 menu1("디저트")
#
#             elif x3 == "7":
#                 menu1("맥카페")
#
#             elif x3 == "8":
#                 menu1("음료")
#
#             elif x3 == "9":
#                 menu1("해피밀")
#         else:
#             break
#     else:
#         break
#
